{
  "lastUpdated": "2024-12-20",
  "source": "LinkedIn Recommendations",
  "recommendations": [
    {
      "id": 1,
      "name": "Tomás Alegria Aguiar",
      "title": "Experienced Senior Consultant | SAP Integration Suite Lead",
      "date": "August 26, 2025",
      "relationship": "Tomás was senior to Samuel but didn't manage Samuel directly",
      "quote": "No início da minha carreira, tive a oportunidade de trabalhar diretamente com o Samuel num projeto de transformação de RH, e não podia estar mais grato por essa experiência. Não posso deixar de reconhecer o impacto que teve na minha aprendizagem e na forma como reforçou o foco na qualidade da entrega, tanto em mim como nos restantes elementos da equipa. A vasta experiência que possui na entrega de projetos de transformação de RH de grande complexidade, aliada à sua visão estratégica, liderança e espírito colaborativo, garantem não só projetos bem-sucedidos e resultados de excelência, mas também o desenvolvimento de todos com quem trabalha. O seu profissionalismo, a sua capacidade de gestão de equipa e o seu perfeccionismo são verdadeiramente inspiradores. Por todas estas razões, e muitas mais, considero o Samuel um verdadeiro role model. Sem dúvida, um profissional que recomendo de forma inequívoca.",
      "featured": true
    },
    {
      "id": 2,
      "name": "Hildebrando Sala",
      "title": "Director de Capital Humano",
      "date": "October 29, 2024",
      "relationship": "Hildebrando was Samuel's client",
      "quote": "O Samuel é um profissional de excelência com quem tive a oportunidade de trabalhar e aprender em vários projectos estruturantes. Possui uma notável capacidade de integração e aculturação. Além do seu vasto conhecimento técnico e de gestão, destaca-se pela sua habilidade de análise e interpretação do contexto em que se insere, propondo soluções adequadas à realidade e que realmente criam um impacto positivo e transformador. Trabalhar com o Samuel em processos de reestruturação, melhorias, desenvolvimento de políticas e processos de recursos humanos foi extremamente enriquecedor e de elevado valor. Trata-se de um profissional jovem, com uma carreira muito consolidada e versátil, tanto no seu conhecimento como na sua capacidade de gerar soluções. O Samuel é, sem dúvida, o tipo de consultor que, em qualquer geografia, adapta-se, interpreta o contexto e gera soluções transformadoras e palpáveis. É um líder e gestor de projectos comprometido, com princípios cívicos e morais notáveis. Recomendo-o.",
      "featured": true
    },
    {
      "id": 3,
      "name": "José Subtil",
      "title": "Banking and Insurance Leader at Timestamp",
      "date": "October 20, 2024",
      "relationship": "José managed Samuel directly",
      "quote": "I had the pleasure of working with Samuel while he was Senior Consultant and Manager at Deloitte, and I can say that he is an exceptional professional. Samuel has a combination of technical and interpersonal skills that makes him a natural leader. During the time I supervised Samuel's work, he demonstrated an impressive ability to deal with complex projects, always keeping a clear focus on the results. His ability to meet customer needs and his commitment to excellence was a key to the projects success. Samuel also promotes a work environment that promotes his team professional growth. I recommend Samuel without hesitation, I know he will bring value to any team or project in which he is involved.",
      "featured": true
    },
    {
      "id": 4,
      "name": "Tânia Nunes Rodrigues",
      "title": "Consultor de vendas",
      "date": "October 14, 2024",
      "relationship": "Tânia Nunes worked with Samuel on the same team",
      "quote": "Samuel is an excellent professional and person, with focus and dedication that are hard to find. He is a natural leader and has the gift of inspiring others...",
      "featured": false
    },
    {
      "id": 5,
      "name": "Ivo Guimarães",
      "title": "Gestão de Talento | RH Analítico | Transformação Digital | SAP SuccessFactors | Desenvolvimento Humano",
      "date": "October 12, 2024",
      "relationship": "Ivo was Samuel's client",
      "quote": "O Samuel é além de um profissional extremamente disponível e conhecedor da sua área de actuação, um ser humano ímpar. Procura congregar as ideias do grupo pra encontrar soluções que sejam sempre focadas em resultados. Foi um prazer imensurável trabalhar com o Samuel pois mais uma vez tive a certeza que vale mais trabalhar com boas pessoas do que com pessoas boas....",
      "featured": true
    },
    {
      "id": 6,
      "name": "Marta Oliveira Dias",
      "title": "Improvement & Performance Manager @VodafoneZiggo",
      "date": "May 12, 2022",
      "relationship": "Marta worked with Samuel on the same team",
      "quote": "I had the plesure to work with Samuel during my last project at Deloitte. He is a dedicated professional that always goes above and beyond to make an impact that matters. Samuel does a remarkable job leading his teams while being commited and always available to help others. Moreover, he is extremely hard-working, determined and always challanges us to do our best. It was an honour learning from him!",
      "featured": true
    },
    {
      "id": 7,
      "name": "João Miguel Lince",
      "title": "Human Resources Manager at Sublime Hotels",
      "date": "September 8, 2016",
      "relationship": "João Miguel and Samuel studied together",
      "quote": "O Samuel é sem dúvida um excelente profissional. Tive o privilégio de estudar com ele e desde cedo foi possível perceber que o futuro que lhe esperava era risonho, tal como demonstra o seu trajeto profissional. Humilde, trabalhador, eficaz, pragmático entre outras competências importantes na área onde se insere, os Recursos Humanos. Um exemplo!",
      "featured": false
    },
    {
      "id": 8,
      "name": "Ricardo Ramos da Silva",
      "title": "HR and HRIT Expert | SAP SuccessFactors SME & Solution Architect",
      "date": "June 4, 2015",
      "relationship": "Samuel was senior to Ricardo but didn't manage Ricardo directly",
      "quote": "I had the pleasure of working with Samuel in his first unofficial project as a senior consultant and was instantly impressed. Samuel effortlessly and expertly managed to juggle multiple issues in the toughest situation, his leadership and team building skills were exceptional, and I was very impressed by his consulting capabilities and willingness to coach new members. As a Senior Consultant, Samuel has my highest recommendation and I can safely say that I have learned a lot by working with him.",
      "featured": false
    },
    {
      "id": 9,
      "name": "Joana Costa Pereira",
      "title": "Global Leadership Consulting, Senior Manager @ Boyden",
      "date": "April 16, 2014",
      "relationship": "Joana worked with Samuel on the same team",
      "quote": "Samuel has a strategic-oriented approach to his work, providing in depth analysis, innovative approaches and technically supported fundaments. I enjoyed working with Samuel and i would return to him for advisory and technical support regarding Human Resources theory. Mostly Samuel is organized, analytical, hardworking and a great spirit contributor to a team.",
      "featured": false
    },
    {
      "id": 10,
      "name": "Luis Martinez",
      "title": "Associate Professor of Marketing and Behavioral Science _ Nova SBE",
      "date": "March 1, 2012",
      "relationship": "Luis managed Samuel directly",
      "quote": "Samuel attended my Leadership classes (degree in HRM). He is undoubtedly a bright student and performed particularly well (top 10% of his class). He is highly energetic and has strong convictions.",
      "featured": false
    },
    {
      "id": 11,
      "name": "Ana M. Correia",
      "title": "Diretora Desenvolvimento Humano e Organizacional na Leroy Merlin",
      "date": "July 27, 2011",
      "relationship": "Ana M. worked with Samuel on the same team",
      "quote": "Trabalhar com o Samuel é uma experiência bastante positiva. É uma pessoa que procura sempre aprender mais e fazer melhor, mostrando ser muito empenhado e dedicado naquilo que faz.",
      "featured": false
    },
    {
      "id": 12,
      "name": "Mariana Cabral Janeiro",
      "title": "Senior Business Analyst",
      "date": "June 20, 2011",
      "relationship": "Mariana and Samuel studied together",
      "quote": "O Samuel é uma pessoa extremamente dedicada ao seu trabalho. Estabelece objectivos desafiantes e atinge-os com trabalho árduo, que é recompensado com o seu sucesso. Trabalhar com ele é ter a certeza de que faremos parte de uma equipa vencedora! Estou certa de que será bem sucedido profissionalmente.",
      "featured": false
    }
  ],
  "displaySettings": {
    "maxDisplayed": 5,
    "rotationEnabled": true,
    "rotationIntervalMs": 5000
  }
}
